{
  "Version": "3",
  "Year": "2025",
  "Semester": "Fall",
  "project_name": "Predictive Modeling and Explainable AI for Autism Spectrum Disorder Diagnosis: Advanced Machine Learning Analysis of SFARI-Supported Datasets",
  "Objective": " \n            This project aims to develop and validate advanced machine learning models for autism spectrum disorder (ASD) \n            diagnosis prediction using comprehensive datasets from SFARI-supported research in collaboration with the Department of \n            Psychological & Brain Sciences. The research focuses on creating novel interpretable AI algorithms that:\n\n            1. **Predict autism diagnosis accurately** using structured behavioral data, demographic information, and unstructured \n            free-text responses from social inference tasks\n            2. **Identify autism subclusters** within diagnosed populations using unsupervised learning techniques to discover phenotypic \n            subtypes and similar behavioral patterns\n            3. **Extract insights from unstructured text data** using advanced natural language processing techniques on free-form responses \n            about social impressions and person descriptions\n            4. **Develop explainable AI frameworks** that identify the most reliable predictors for both diagnosis classification and cluster \n            membership determination\n            5. **Create generalizable models** that can transfer knowledge from experimental datasets to new populations and different \n            assessment measures\n            6. **Implement feature importance analysis** to understand what behavioral, cognitive, and linguistic characteristics drive model predictions\n            7. **Build cross-domain validation systems** that test model performance on out-of-sample data from different experimental paradigms\n\n            The research contributes novel interpretable machine learning algorithms specifically designed for autism research and provides\n             practical diagnostic tools that can enhance early identification and personalized intervention approaches. This work targets\n              publication in top-tier venues such as Nature Machine Intelligence, JAMA Psychiatry, Molecular Autism, Autism Research, or\n               specialized AI in healthcare journals, and aligns with SFARI's mission to advance autism research through data analysis.\n            ",
  "Dataset": "\n            The project leverages comprehensive, real-world autism research datasets through established collaboration\n             with the Department of Psychological & Brain Sciences and SFARI-supported resources:\n\n            **Primary Experimental Datasets (Available through Collaboration):**\n\n            1. **Social Inference Learning Task Dataset**:\n               - Structured behavioral data from autism and neurotypical participants\n               - Learning performance metrics across multiple experimental blocks\n               - Demographic information including age, gender, cognitive abilities, and diagnostic status\n               - Item preference ratings and similarity judgments for social stimuli\n               - Computational modeling parameters from existing published research (Rosenblau et al., 2020, Biological Psychiatry: CCNI)\n\n            2. **Free-Text Response Corpus** (Novel NLP Opportunity):\n               - Unstructured written responses describing learned person impressions\n               - Categorized content analysis including: social traits, personality descriptions, behavioral observations, trait adjectives usage\n               - Multi-participant responses providing rich linguistic patterns associated with autism vs. neurotypical social cognition\n               - Cross-validation dataset with different experimental setup (2 vs. 3 learning runs, different stimuli, varied response formats)\n\n            3. **Neurocognitive Assessment Battery**:\n               - Standardized cognitive assessments and behavioral questionnaires\n               - Social cognition measures and autism diagnostic assessments\n               - Individual difference measures in social inference abilities\n               - Multi-modal data integration opportunities\n\n            **SFARI-Supported Public Datasets for Model Validation:**\n\n            4. **SPARK Dataset** (Simons Foundation Powering Autism Research):\n               - 50,000+ participants with autism and family members\n               - Comprehensive phenotypic data, medical histories, and behavioral assessments\n               - Standardized diagnostic instruments and outcome measures\n               - Available through SFARI Base with controlled access\n\n            5. **Simons Simplex Collection (SSC)**:\n               - Detailed phenotypic characterization of autism families\n               - Cognitive assessments, behavioral measures, and developmental histories\n               - High-quality diagnostic validation data for model benchmarking\n\n            6. **Simons Searchlight Database**:\n               - Genetic and phenotypic data from individuals with autism-associated gene variants\n               - Longitudinal developmental data and outcome measures\n               - Genotype-phenotype correlation opportunities\n\n            **Benchmark Datasets from Literature:**\n\n            7. **Published Autism ML Datasets**:\n               - ASD screening datasets with established accuracy benchmarks (98% children, 81% adults performance)\n               - Multi-site validation datasets for cross-population generalization testing\n               - Established feature sets and evaluation metrics for performance comparison\n\n            **Data Integration and Processing Framework:**\n            - Subject-level data splits ensuring no individual appears in both training and test sets\n            - Multi-modal data fusion techniques combining structured and unstructured data\n            - Cross-dataset validation protocols for generalizability assessment\n            - Privacy-preserving analysis methods compliant with HIPAA and IRB requirements\n            ",
  "Rationale": "\n            Autism spectrum disorder affects 1 in 36 children, yet current diagnostic approaches rely heavily on \n            subjective clinical assessments that can delay diagnosis by years. Recent advances in machine learning have\n             shown promising results for autism prediction, with some studies achieving 98% accuracy in children,\n              but significant research gaps remain:\n\n            **Research Gap 1: Limited Integration of Structured and Unstructured Data**\n            Existing autism ML research primarily uses structured behavioral data or questionnaires, rarely integrating \n            rich unstructured text data that captures natural language patterns associated with autism. The free-text\n             responses from social inference tasks represent a novel data source that could reveal linguistic and cognitive\n              patterns invisible to traditional structured assessments.\n\n            **Research Gap 2: Insufficient Explainable AI in Autism Research**\n            Current machine learning approaches in autism research often function as \"black boxes,\" providing predictions \n            without explaining which features drive classifications. This limits clinical utility and scientific\n             understanding of autism heterogeneity. There's a critical need for interpretable models that can identify\n              the most reliable diagnostic predictors.\n\n            **Research Gap 3: Lack of Autism Subtype Discovery Using Advanced Clustering**\n            While autism is recognized as highly heterogeneous, most research treats it as a single diagnostic category. \n            Advanced unsupervised learning techniques could identify meaningful subtypes within autism populations,\n             potentially leading to more personalized interventions and better understanding of autism phenotypes.\n\n            **Research Gap 4: Limited Cross-Domain Generalization Testing**\n            Existing studies rarely test whether models trained on one experimental paradigm generalize to different \n            assessment approaches or populations. This limits real-world clinical applicability and scientific validity.\n\n            **Research Gap 5: Underutilization of SFARI-Supported Large Datasets**\n            Despite substantial investments in large-scale autism datasets (SPARK, SSC, Simons Searchlight), many datasets\n             remain underutilized for advanced machine learning applications. This project directly addresses SFARI's call\n              for increased utilization of existing data resources.\n\n            This research addresses these critical gaps by developing novel interpretable machine learning algorithms \n            specifically designed for autism research, contributing to both computational psychiatry and clinical \n            autism research. The work has strong potential for high-impact publication and directly aligns with SFARI's mission:\n\n            **Target Publication Venues:**\n            - **Nature Machine Intelligence** (Impact Factor: 25.9) - Premier venue for AI applications in healthcare\n            - **JAMA Psychiatry** (Impact Factor: 19.3) - Top psychiatric research journal\n            - **Molecular Autism** (Impact Factor: 6.3) - Leading autism research venue\n            - **Autism Research** (Impact Factor: 4.9) - Specialized autism research journal\n            - **Nature Digital Medicine** (Impact Factor: 12.9) - Digital health and AI applications\n            - **Journal of Medical Internet Research** (Impact Factor: 7.4) - Health informatics and digital health\n\n            **SFARI Mission Alignment:**\n            This project directly supports SFARI's goal to \"advance the basic science of autism and related \n            neurodevelopmental disorders\" through innovative data analysis of existing resources, maximizing the value of \n            previous research investments while generating new scientific knowledge.\n            ",
  "Approach": "\n            **Research Methodology**: Experimental machine learning approach combining supervised learning for diagnosis \n            prediction, unsupervised learning for subtype discovery, natural language processing for text analysis, and \n            explainable AI techniques for model interpretation\n\n            **Phase 1: Data Integration and Preprocessing (Weeks 1-2)**\n            - Comprehensive data integration of structured behavioral data, demographic information, and free-text responses\n            - Advanced text preprocessing including tokenization, lemmatization, and feature extraction from social inference descriptions\n            - Data quality assessment and missing value imputation using advanced techniques (MICE, KNN imputation)\n            - Establishment of subject-level train-validation-test splits ensuring no data leakage between individuals\n            - SFARI dataset access setup and initial exploratory data analysis\n\n            **Phase 2: Advanced Predictive Modeling Development (Weeks 3-8)**\n            - **Autism Diagnosis Prediction Models** (Weeks 3-4):\n              * Implementation of ensemble methods (Random Forest, XGBoost, LightGBM) for structured data classification\n              * Deep learning approaches using neural networks with attention mechanisms for complex pattern recognition\n              * Multi-modal fusion techniques combining structured behavioral data with text features\n              * Advanced feature engineering including interaction terms and domain-specific feature construction\n\n            - **Natural Language Processing for Free-Text Analysis** (Weeks 5-6):\n              * BERT and RoBERTa-based text classification for autism vs. neurotypical language patterns\n              * Topic modeling (LDA, BERTopic) to discover themes in person descriptions across groups\n              * Sentiment analysis and linguistic feature extraction (syntactic complexity, semantic coherence)\n              * Custom embeddings training on autism-specific text data for domain adaptation\n\n            - **Unsupervised Learning for Autism Subtype Discovery** (Weeks 7-8):\n              * Advanced clustering algorithms (hierarchical clustering, DBSCAN, Gaussian mixture models) for autism phenotype discovery\n              * Dimensionality reduction techniques (PCA, UMAP, t-SNE) for high-dimensional behavioral data visualization\n              * Cluster validation using internal metrics (silhouette score, calinski-harabasz index) and external validation\n              * Subtype characterization using interpretable machine learning techniques\n\n            **Phase 3: Explainable AI and Interpretability Framework (Weeks 9-11)**\n            - Implementation of model-agnostic interpretability techniques (SHAP, LIME, permutation importance)\n            - Development of custom feature importance analysis for autism-specific behavioral patterns\n            - Creation of interactive visualization dashboards for model explanation and clinical decision support\n            - Cross-validation of feature importance across different models and datasets\n            - Clinical relevance assessment of identified predictive features\n\n            **Phase 4: Cross-Domain Validation and Generalization Testing (Weeks 12-14)**\n            - Validation on SFARI-supported datasets (SPARK, SSC, Simons Searchlight) for model generalizability\n            - Cross-dataset performance evaluation and domain adaptation techniques\n            - Out-of-sample prediction testing on held-out experimental data with different paradigms\n            - Statistical analysis of model robustness and generalization capabilities\n            - Comparison with existing autism prediction benchmarks and published results\n\n            **Phase 5: Research Publication and Clinical Translation (Weeks 15-16)**\n            - Preparation of high-impact research manuscript for Nature Machine Intelligence or JAMA Psychiatry\n            - Development of clinical decision support prototype and user interface mockups\n            - Creation of open-source toolkit for autism researchers to apply developed methods\n            - Preparation of SFARI grant application based on preliminary results for continued research\n            - Documentation of best practices for autism ML research and interpretable AI in clinical settings\n            ",
  "Timeline": "\n            **Week 1**: Data integration, preprocessing, and comprehensive exploratory analysis of collaborative dataset\n            **Week 2**: SFARI dataset access setup, text preprocessing, and establishment of evaluation frameworks\n            **Weeks 3-4**: Supervised learning model development for autism diagnosis prediction using ensemble and deep learning approaches\n            **Weeks 5-6**: Natural language processing implementation for free-text analysis and linguistic pattern discovery\n            **Weeks 7-8**: Unsupervised learning algorithms for autism subtype discovery and phenotype clustering\n            **Week 9**: Explainable AI framework implementation with SHAP, LIME, and custom interpretability techniques\n            **Week 10**: Interactive visualization development and clinical decision support interface design\n            **Week 11**: Feature importance validation and clinical relevance assessment of identified predictors\n            **Week 12**: Cross-domain validation on SFARI datasets (SPARK, SSC, Simons Searchlight)\n            **Week 13**: Out-of-sample generalization testing and statistical robustness analysis\n            **Week 14**: Performance benchmarking against published results and comprehensive evaluation\n            **Week 15**: High-impact journal manuscript preparation and submission to target venue\n            **Week 16**: Clinical translation framework development, open-source toolkit creation, and future grant preparation\n            ",
  "Expected Number Students": "\n            This project is designed for **1 student** with strong interdisciplinary background in:\n            - **Machine Learning and Deep Learning** (required): Experience with ensemble methods, neural networks, \n            natural language processing, and explainable AI techniques\n            - **Statistical Analysis and Data Science** (required): Advanced statistical methods, cross-validation, model evaluation, \n            and hypothesis testing\n            - **Natural Language Processing** (preferred): Text preprocessing, transformer models (BERT, RoBERTa), and linguistic\n             feature extraction\n            - **Clinical Research Methods** (preferred): Understanding of psychological assessment, autism research, and clinical validation approaches\n            - **Programming and Software Development** (required): Python, R, machine learning libraries (scikit-learn, PyTorch, transformers), and data visualization\n\n            The interdisciplinary scope combining machine learning, clinical psychology, and autism research ensures the\n             single student can make substantial individual contributions suitable for first-author publication in a high-impact venue.\n              The collaboration with Department of Psychological & Brain Sciences provides domain expertise while maintaining clear individual \n              research contributions for the student.\n            ",
  "Research Contributions": "\n            **Novel Theoretical Contributions:**\n            1. **Multi-Modal Autism Prediction Framework**: New machine learning architecture that integrates structured \n            behavioral data with unstructured text responses for enhanced diagnostic accuracy\n            2. **Autism Phenotype Discovery Algorithms**: Novel unsupervised learning approaches specifically designed for \n            identifying autism subtypes using behavioral and linguistic patterns\n            3. **Interpretable AI for Clinical Autism Research**: Advanced explainable AI techniques adapted for autism \n            research that provide clinically meaningful feature importance analysis\n            4. **Cross-Domain Generalization Methodology**: Frameworks for testing autism ML model performance across different \n            experimental paradigms and populations\n\n            **Methodological Contributions:**\n            1. **Autism-Specific NLP Pipeline**: Comprehensive natural language processing framework for analyzing social \n            inference text responses in autism research\n            2. **Clinical Interpretability Framework**: Systematic approach for translating machine learning insights into \n            clinically actionable information for autism diagnosis and intervention\n            3. **Multi-Dataset Validation Protocol**: Standardized methodology for evaluating autism prediction models across \n            diverse SFARI-supported datasets\n            4. **Privacy-Preserving Autism Research Methods**: Techniques for conducting advanced ML analysis while maintaining\n             participant privacy and data security\n\n            **Practical Contributions:**\n            1. **Open-Source Autism ML Toolkit**: Complete software package for autism researchers to apply developed methods to new datasets\n            2. **Clinical Decision Support Prototype**: Interactive system for clinicians to understand autism risk factors and diagnostic predictions\n            3. **SFARI Data Analysis Framework**: Reusable pipeline for advanced analysis of SFARI-supported datasets\n            4. **Autism Subtype Characterization Tool**: System for identifying and characterizing autism phenotypes in research and clinical settings\n\n            **Publication Strategy and Target Venues:**\n\n            **Primary Targets:**\n            - **Nature Machine Intelligence** (Impact Factor: 25.9): Premier venue for AI applications in healthcare and biomedical research\n            - **JAMA Psychiatry** (Impact Factor: 19.3): Top-tier psychiatric research journal with high clinical impact\n            - **Molecular Autism** (Impact Factor: 6.3): Leading specialized venue for autism research with strong computational focus\n\n            **Secondary Targets:**\n            - **Nature Digital Medicine** (Impact Factor: 12.9): Digital health applications and AI in medicine\n            - **Autism Research** (Impact Factor: 4.9): Specialized autism research venue with established audience\n            - **Journal of Medical Internet Research** (Impact Factor: 7.4): Health informatics and digital health research\n\n            **Conference Venues:**\n            - **International Society for Autism Research (INSAR) Annual Meeting**: Premier autism research conference\n            - **NeurIPS Machine Learning for Health (ML4H) Workshop**: AI applications in healthcare\n            - **AAAI Conference on Artificial Intelligence**: AI methodology and applications\n            - **AMIA Annual Symposium**: Biomedical informatics and health AI\n\n            **SFARI-Specific Outcomes:**\n            - **SFARI Webinar Presentation**: Dissemination of results to autism research community\n            - **SFARI Annual Report Contribution**: Documentation of successful data utilization\n            - **Follow-up Grant Applications**: Foundation for larger-scale SFARI funding requests\n\n            **Expected Research Impact:**\n            This research addresses fundamental challenges in autism diagnosis and research through innovative application \n            of explainable AI techniques. The integration of structured and unstructured data sources provides new insights \n            into autism heterogeneity and diagnostic markers. The work is positioned for high citation impact due to:\n            - Direct clinical relevance for early autism identification\n            - Novel methodological contributions to interpretable machine learning in healthcare\n            - Comprehensive utilization of valuable SFARI-supported datasets\n            - Open-source tool development for broader research community adoption\n\n            **Broader Impact:**\n            - **Clinical Practice**: Improved diagnostic tools for earlier autism identification\n            - **Research Community**: Advanced methods for autism heterogeneity research\n            - **Public Health**: Population-level screening and risk assessment capabilities\n            - **Technology Transfer**: Foundation for commercial diagnostic tool development\n            - **Policy Influence**: Evidence-based insights for autism research funding and clinical guidelines\n            ",
  "Possible Issues": "\n            **Technical Challenges and Mitigation Strategies:**\n\n            **Challenge 1: Data Quality and Heterogeneity Across Sources**\n            - Risk: Different data collection protocols and assessment instruments across collaborative and SFARI datasets may introduce bias\n            - Mitigation: Implement robust data harmonization techniques, use domain adaptation methods, conduct sensitivity\n             analyses across different data sources, and collaborate closely with domain experts for validation\n\n            **Challenge 2: Model Interpretability vs. Performance Trade-offs**\n            - Risk: Highly interpretable models may sacrifice predictive accuracy, while complex models may lack clinical interpretability\n            - Mitigation: Develop ensemble approaches combining interpretable and complex models, implement post-hoc explanation techniques,\n             validate interpretations with clinical experts, and create multiple model variants optimized for different use cases\n\n            **Challenge 3: Generalization Across Autism Heterogeneity**\n            - Risk: Models may not generalize well across different autism subtypes, age groups, or cognitive ability levels\n            - Mitigation: Implement stratified validation approaches, develop subtype-specific models, use robust cross-validation\n             techniques, and validate across diverse populations within SFARI datasets\n\n            **Challenge 4: Natural Language Processing Complexity**\n            - Risk: Free-text responses may be highly variable, contain minimal information, or require extensive preprocessing\n            - Mitigation: Implement multiple NLP approaches (rule-based, statistical, neural), develop custom text quality metrics,\n             use data augmentation techniques, and create backup strategies using structured data only\n\n            **Challenge 5: SFARI Dataset Access and Integration Complexity**\n            - Risk: Accessing and integrating multiple SFARI datasets may face administrative, technical, or timeline challenges\n            - Mitigation: Establish early contact with SFARI Base administrators, prepare comprehensive data access requests, \n            develop modular analysis pipelines that can work with subsets of data, and maintain backup analysis plans\n\n            **Challenge 6: Statistical Power and Sample Size Limitations**\n            - Risk: Some analyses, particularly subtype discovery, may require larger sample sizes than available\n            - Mitigation: Implement power analysis frameworks, use appropriate statistical techniques for smaller samples,\n             conduct simulation studies, and focus on effect sizes rather than statistical significance alone\n\n            **Ethical and Privacy Considerations:**\n\n            **Challenge 7: Participant Privacy and Data Security**\n            - Risk: Working with sensitive autism research data requires strict privacy protection and secure handling\n            - Mitigation: Implement data de-identification protocols, use secure computing environments, follow IRB guidelines\n             strictly, obtain necessary approvals, and develop privacy-preserving analysis methods\n\n            **Challenge 8: Clinical Translation and Validation**\n            - Risk: ML models may not translate effectively to real-world clinical settings or may create biased diagnostic tools\n            - Mitigation: Collaborate with clinicians throughout development, conduct bias audits across demographic groups, \n            implement fairness-aware ML techniques, and design human-in-the-loop validation protocols\n\n            **Project Management and Collaboration Risks:**\n\n            **Risk: Interdisciplinary Coordination Complexity**\n            - Mitigation: Establish clear communication protocols with Psychology & Brain Sciences collaborators, schedule\n             regular meetings, define clear roles and responsibilities, and maintain detailed project documentation\n\n            **Risk: Technical Implementation Timeline**\n            - Mitigation: Prioritize core contributions, implement agile development practices, prepare backup analysis\n             approaches, and maintain regular advisor consultations\n\n            **Risk: Data Access and Processing Delays**\n            - Mitigation: Start data access procedures early, develop parallel analysis tracks, implement automated\n             preprocessing pipelines, and prepare contingency plans for data availability issues\n\n            **Publication Strategy Risks:**\n\n            **Risk: Competitive Research Environment**\n            - Mitigation: Focus on unique methodological contributions and novel data integration approaches, target multiple \n            publication venues, prepare workshop papers for early visibility, and maintain active engagement with autism research community\n\n            **Risk: Journal Review Process Complexity**\n            - Mitigation: Ensure rigorous methodological approaches, collaborate with domain experts for clinical validation, \n            prepare comprehensive supplementary materials, and be prepared for iterative peer review process\n\n            **SFARI Grant Application Considerations:**\n\n            **Risk: Alignment with SFARI Priorities and Review Criteria**\n            - Mitigation: Carefully study SFARI mission and funding priorities, engage with SFARI scientific team during \n            development, prepare preliminary results that demonstrate feasibility, and ensure clear articulation of autism research relevance\n            ",
  "Proposed by": "Dr. Amir Jafari and Dr. Gabriela Rosenblau in collaboration with Department of Psychological & Brain Sciences",
  "Proposed by email": "ajafari@gwu.edu, grosenblau@email.gwu.edu>",
  "instructor": "Amir Jafari",
  "instructor_email": "ajafari@gwu.edu",
  "collaborator": "Department of Psychological & Brain Sciences",
  "funding_opportunity": "SFARI 2025 Data Analysis Request for Applications ($300,000 over 2 years)",
  "github_repo": "https://github.com/amir-jafari/Capstone"
}