{
  "Version": "5",
  "Year": "2025",
  "Semester": "Fall",
  "project_name": "Health-Aware School Meal Recommendations with Contextual Bandits",
  "Objective": " \n            The goal of this project is to develop a free and open source analysis and recommendation tool that can be used \n            by non-technical school nutritionists, cafeteria staff, and researchers to optimize school meal offerings for \n            both student preference and healthiness. The tool will leverage Contextual Multi-Armed Bandit (CMAB) algorithms \n            to recommend meals that balance popularity and nutrition. Our project is affiliated with Fairfax County Public \n            Schools (FCPS), which provides the historical meal sales data used in this project. Built by data scientists, the \n            tool is designed to be used by non-technical stakeholders, empowering them to make data-driven decisions to \n            improve student nutrition while maintaining participation.\n\n            Develop or refine a methodological approach using CMAB to recommend meals based on contextual features such as \n            school, time of day, and day of the week, while incorporating a healthiness weighting into the reward function.  \n\n            Integrate this CMAB-based recommendation system into an open source library for school nutrition \n            research, so that future stakeholders can use your methodology to make healthier, data-informed decisions. \n            ",
  "Dataset": "\n            FCPS Sales Data: Box Folder Link\n            ",
  "Rationale": "\n            School nutrition is a critical factor in student health, academic performance, and long-term well-being. However, \n            cafeteria participation is often influenced by student preferences for popular but less healthy food options, \n            making it challenging for nutritionists to balance meal appeal with nutritional goals. Data-driven approaches \n            can help address this challenge, but many school staff and researchers lack the technical expertise to analyze \n            meal sales and optimize offerings at scale. \n\n            Students can apply their Data Science and Reinforcement Learning skills to develop a methodology using \n            Contextual Multi-Armed Bandits (CMAB) that recommends meals based on both popularity and healthiness, \n            tailored to each school and time of day. By integrating this methodology into an open source tool, non-technical \n            users will be empowered to make evidence-based decisions that improve student nutrition while maintaining \n            participation rates. In doing so, students contribute to healthier school environments and provide a scalable \n            framework for future research in data-driven school nutrition planning.\n            ",
  "Approach": "\n            [Understanding the Reinforcement Learning (RL) Framework] \n            Students will learn the RL framework, focusing on Contextual Multi-Armed Bandits (CMAB), including:\n\n            - Understanding CMAB assumptions and limitations: stationarity, independence, exploration-exploitation trade-off.\n            - State space design: selecting relevant contextual features (e.g., school, time_of_day, day_of_week).\n            - Action space design: defining meal options as arms in the bandit framework (e.g. item_id).\n            - Reward design: formulating reward signals based on sales data and health penalty factor (reward = total_meals_served + λ * healthiness_score_of_item).\n            - Algorithm selection: evaluating CMAB algorithms (e.g. LinUCB).\n\n            [`utils/env.py`]\n            Students will implement the CMAB environment to simulate meal recommendation scenarios using the FCPS dataset:\n\n            - load_data() -> func: Load preprocessed FCPS sales CSV.\n            - get_states() -> func: Return matrix (m × n) where m = time steps, n = contextual features.\n            - get_actions() -> func: Return matrix (m × p) where m = time steps, p = meal options.\n            - get_health_scores() -> func: Vector (p × 1) with healthiness score for each meal option.\n\n            [`model.py` & `main.py`]\n            Students will implement the LinUCB algorithm and related methods for training and inference:\n\n            - LinUCB() & __init__() -> class: Initialize CMAB model.\n            - self.train() -> method/func: Train the model on observed rewards.\n            - self.action() -> method/func: Select a valid meal given the current context, considering only meals available at that time step (mask).\n            - self.calculate_reward() (sometimes called bandit()) -> method/func: Compute reward for the chosen action.\n            - self.update() -> method/func: Update model parameters based on observed reward.\n            - self.reset() -> method/func: Reset the model to initial state.\n            - self.save() -> method/func: Save model parameters.\n            - self.recommend() -> method/func: Provide meal recommendations based on learned policy.\n\n            - `main.py` - train and roughly evaluate the CMAB model using the custom environment and FCPS dataset.\n\n            [`utils/metrics.py` & `utils/plot.py`]\n            Students will learn how to measure performance and visualize results:\n\n            - calulate_regret() -> func: Compute regret for evaluation.\n            - calculate_cumulative_reward() -> func: Compute cumulative reward over time.\n\n            - plot_top_meals() -> func: Visualize top-performing meals.\n            - plot_recommendations() -> func: Plot recommendations over time or by context.\n\n            [`benchmark.py`]\n            Students will learn how to run systematic experiments and analyze results:\n\n            - Run multiple experiments with different λ values.\n            - Hyperparameter tuning.\n            - bench_results_to_csv() -> func: Save benchmarking results to CSV for analysis.\n\n            ",
  "Timeline": "\n            [Understanding the Reinforcement Learning (RL) Framework] 1 week\n            [`utils/env.py`] 2 weeks\n            [`main.py` & `model.py`] 5 weeks\n            [`utils/metrics.py` & `utils/plot.py`] 2 weeks (start writting research paper here)\n            [`benchmark.py`] 2 weeks\n            ",
  "Expected Number Students": "\n            Given the scope and complexity of the project, it is recommended to have 2-3 students working collaboratively.\n            ",
  "Research Contributions": "\n            This project will contribute to the broader research and educational community by providing an open-source \n            tool for optimizing school meal recommendations that balance student preferences and healthiness. The tool \n            will be designed for non-technical users, including school nutritionists, cafeteria staff, and educational \n            researchers. Research findings, including insights on student meal choices and health-driven reward weighting, \n            can be published in academic journals as well as presented in educational conferences, helping to inform \n            policy and improve school nutrition practices. The methodology and tool will be made openly available for \n            future researchers and school districts to utilize, enabling data-driven decisions to support healthier school \n            environments.\n            ",
  "Possible Issues": "\n            - Implementing Contextual Multi-Armed Bandits (CMAB) can be complex for students.  \n            - Designing the state and action spaces correctly may be challenging.  \n            - Shaping the reward function to balance popularity and healthiness requires careful consideration.  \n            - Handling unavailable meal options at each time step requires proper action masking.  \n            - Debugging interactions between the environment and the bandit model can be difficult.  \n            - Accurately computing cumulative rewards and regret is essential and may be error-prone.  \n            - Data preprocessing and encoding categorical features from the FCPS dataset may present challenges.\n            ",
  "Proposed by": "Tyler Wallett",
  "Proposed by email": "twallett@gwu.edu",
  "instructor": "Amir Jafari",
  "instructor_email": "ajafari@gwu.edu",
  "collaborator": "Fairfax County Public Schools (FCPS)",
  "funding_opportunity": "Open Source Community Project",
  "github_repo": "None"
}