{
  "Version": "4",
  "Year": "2025",
  "Semester": "Fall",
  "project_name": "Contributing an Open Source Analysis Tool to the Global Community of Researchers Uncovering Social Media Manipulation",
  "Objective": " \n            The goal of this project is to develop a free and open source analysis tool that can be used by non-technical \n            researchers to detect signs of inauthentic (bot) behavior in large datasets of social media activity. The tool\n            will be integrated in the CIB Mango Tree (cibmangotree.org) application library. CIB Mango Tree is a DC-based\n            open source project that is compiling free software tools to uncover signs of coordinated inauthentic behavior\n            (CIB) on social media platforms. Our project is affiliated with Civic Tech DC, a nonprofit that brings \n            together volunteers to work in service of civic and social issues in the Washington, DC, community.\n            Built by data scientists, CIB Mango Tree tools are designed to be used by non-technical researchers, \n            such as journalists, activists, and social scientists. Armed with the tools needed to uncover CIB, our \n            users can successfully raise awareness of social media manipulation and put pressure platforms to curb this challenge.     \n            \n            Develop or refine a methodological approach to unearthing signs of coordinated manipulation in social media,\n            such as by analyzing content or patterns in post time. \n             \n            Develop an effective data visualization dashboard that can articulate insights from your analysis method, so \n            that non-technical users can easily utilize your software to conduct their own social media research. \n            \n            Apply your methodological approach and data visualization dashboard to social media data from Truth Social \n            or Bluesky (where API access is free) and attempt to uncover social media manipulation through inauthentic behavior.\n            These findings can be published in an academic journal as well as in popular media.\n             \n            Integrate this new methodological approach and data visualization dashboard into the CIB Mango Tree’s existing\n            library of software tools, so that future researchers can use your methodology for their own research.\n\n            ",
  "Dataset": "\n            Open Measures (openmeasures.io) provides free API access to data from Truth Social and Bluesky. Students can \n            scrape large datasets of social media activity from these platforms for free, provided the data is over six \n            months old. This will allow students to analyze social media activity around relatively recent seminal political \n            events, such as the 2024 US presidential election.\n\n            Students are welcome to consider other platforms, though data access may require complex scraping methods. \n\n            ",
  "Rationale": "\n            Social media manipulation is a burgeoning issue and has been exacerbated by opaque social media algorithms \n            that promote content based on particular engagement metrics. Foreign and domestic influence actors are using\n            networks of inauthentic accounts to simulate engagement and promote political content that may not reach \n            trending status without inauthentic engagement. The use of AI in social media manipulation is increasingly \n            prevalent. Journalists, researchers, and activists wish to uncover these inauthentic networks, but often \n            lack the technical ability to analyze social media at scale. Students can use their data science expertise\n            to build an analysis methodology that can be utilized by non-technical researchers around the world, through\n            integration into the CIB Mango Tree tool library. In doing so, students will help future researchers raise\n            awareness about inauthentic behavior and social media manipulation so as to force policy change.\n            ",
  "Approach": "\n        [CIB Mango Tree Team Introduction] Students will get to know the existing CIB Mango Tree team of data scientists, \n        web developers, UX designers, and project managers to understand how to build software to align with project goals. \n        \n        [Data Extraction] Students will select a political event whose related online discourse they wish to analyze. \n        Students will identify relevant keywords and a time period through which to capture relevant social media activity\n        in a large csv/json file. \n         \n        [Methodology Development] Students will identify a common social media manipulation technique (such as coordinated posting)\n        and derive a data science methodology that can be used to detect this technique in large datasets. Students can \n        create a new methodology, or improve/augment an existing methodology from the literature. \n         \n        [Experimentation] Students will test the methodology on the extracted dataset to examine whether it can effectively \n        reveal inauthentic behavior. \n        \n        [Data Visualization] Students will ideate and iterate data visualization methods that can be grasped easily by non-technical users. \n        [Integration] Students will package the backend analysis methodology and frontend data visualization dashboard into\n        a single tool that can be integrated into the CIB Mango Tree library. \n         \n        [Writing] Students will write an article explaining their development of an analysis method and application to\n        social media data around a particular political event. \n\n            ",
  "Timeline": "\n        [CIB Mango Tree Team Introduction] 1 week\n        [Data Extraction] 1 week\n        [Methodology Development] 6 weeks\n        [Experimentation] 2 weeks\n        [Data Visualization] 4 weeks\n        [Integration] 2 weeks\n        [Writing] 3 weeks\n\n            ",
  "Expected Number Students": "\n            Given that the students are implementing one tool, and a requirement to engage closely with the existing CIB \n            Mango Tree team, a smaller student team of 1-3 students will be appropriate. \n            ",
  "Research Contributions": "\n            This project will contribute to the global research community by providing an open-source tool for detecting \n            coordinated inauthentic behavior on social media platforms. The tool will be designed for non-technical\n            researchers including journalists, activists, and social scientists. Research findings can be published in \n            academic journals as well as popular media, helping to raise awareness about social media manipulation and \n            pressure platforms to address these challenges. The methodology and tool will be integrated into the CIB Mango\n            Tree library for future researchers to utilize.\n            ",
  "Possible Issues": "\n            Finding an effective methodology: Methodologies should be well-tailored so as to be able to uncover signs of \n            inauthentic behavior, yet simple enough so that future users and those consuming your research findings can \n            understand the methodology. If users and research consumers cannot grasp the methodology easily, it will be\n            less effective at raising public awareness of the problem of social media manipulation. \n             \n            LLM integration: CIB Mango Tree tool users include activists who are researching sensitive political \n            topics like authoritarian propaganda. In many cases, they do not wish to run their datasets of social media\n            activity through online servers – instead, they aim to run analyses on their personal machines. Therefore, \n            students who wish to leverage generative AI for bot detection will have to think of ways to provide\n            these methodologies to users running the program on their personal machines. \n              \n            Simple data visualization: Research that uncovers social media manipulation is always aided by effective\n            data visualization, as the policymakers and civil society groups who have the power to act against manipulation\n            are generally non-technical. Refining and settling on effective data visualizations is equally as challenging\n            as developing the original methodology for detecting inauthentic behavior. \n               \n            Speaking to non-technical users: The end users of the technology students develop will be non-technical\n            individuals who are subject matter experts in disinformation, propaganda, and information operations. \n            Beyond effective visualizations, students will have to familiarize themselves with the disinformation \n            research field so as to learn how to explain complex data science methodologies in the language understood by end users. \n\n            ",
  "Proposed by": "CIB Mango Tree",
  "Proposed by email": "sandobenjamin@gmail.com",
  "instructor": "Amir Jafari",
  "instructor_email": "ajafari@gwu.edu",
  "collaborator": "Civic Tech DC",
  "funding_opportunity": "Open Source Community Project",
  "github_repo": "Link"
}