{
  "Version": "7",
  "Year": "2026",
  "Semester": "Spring",
  "project_name": "Enhancing a multi-agent platform to support health professions understanding of professional roles (Building on the existing BRIDGE Project)",
  "Objective": "\n            Our team is seeking to take the next step in an already successful approach Of developing and implementing a custom multi agent generative AI platform for students in the health professions to help them understand roles and responsibilities. The system as it currently operates has six separate AI agents that a student can select from, each one of those agents is trained to behave and represents a different healthcare profession such as medical doctor, nurse, public health professional, healthcare administrator, social worker, physical therapist. We would like to enhance the realism of agent responses in this next iteration of the project. Interested students should have familiarity and a desire to create more human like and authentic AI agent interactions with humans that are training for professional roles. Trying to achieve here is a simulacrum of expertise. To create models of ideal collaborators in each one of these health professions. Agents that know when to share generously. To respond with just a couple sentences. Know when to refer to one of the other colleague agents so that students can get the best response from the right expert agent. \n\n            ",
  "Dataset": "\n            Training and RAG data are either open source and freely available on the web or are proprietary GW resources that can be utilized for this project . Data is proprietary to GW and its partners and is FERPA protected, and students will need to agree to parameters of the GW IRB (Dr. Wiss) to work with data from student interactions with the platform.       ",
  "Rationale": "\n\n            ",
  "Approach": " Review open source code developed for the initial pilot and gain familiarity with the current system.  From there, plan for the addition of 3-4 additional agents, and develop a plan for new agent features such as: referring to a colleague agent when appropriate, appropriate response length, triggering another agent to respond/weigh-in where appropriate, expanding the knowledge base for each agent via RAG. From there we will engage in a process together where we will create new rules and behaviors for each one of the agents that mirrors expert mentorship and conversational responses for each of the generative AI agents. Also plan to increase the fidelity and helpfulness of their responses by growing the resource libraries for each AI agent using RAG.\n\n\n            ",
  "Timeline": "\n            Week 1:    \n            Week 2:    Weeks one and two - ideation, planning, and high level requirements gathering\n            Week 3:    \n            Week 4:    \n            Week 5:    \n            Week 6:    \n            Week 7:    Weeks 3-7 - Prototype development and iteration round one\n            Week 8:    Week 8 - ideation round 2 and develop final development plan \n            Week 9:    Weeks 9 through 12 - Taking the prototype\n            Week 10:    \n            Week 11:    \n            Week 12:    Pilot test with 200 students from different health professions program \n            Week 13:    Weeks 13-14 Project wrap up and continuity planning\n            Week 14:    \n\n            TOTAL: 14 weeks (one semester)\n\n            KEY MILESTONES:\n            - Week 2:  \n            - Week 4:  \n            - Week 6:  \n            - Week 8:  \n            - Week 10:\n            - Week 12:\n            - Week 14:\n\n            DELIVERABLES BY WEEK 14:\n\n            ",
  "Expected Number Students": "\n            RECOMMENDED: 2 students\n\n            ROLE DISTRIBUTION FOR 1 STUDENTS:\n\n            Student 1:\n            - Responsibilities: Lead coder\n\n Student 2:\n            - Responsibilities: Lead systems archtect\n\n            ",
  "Research Contributions": "\n         Outside of this project students will have the opportunity to participate in research activities related to the pilot.  Please know that our last two pilots in this area have led to several publications and interested students working on the project will have the opportunity to also collaborate on this research separate from the requirements for this capstone course.\n            ",
  "Possible Issues": "\n            TECHNICAL CHALLENGES AND SOLUTIONS:\n\n\n            RISK MITIGATION TIMELINE:\n            - Weeks 1-2:\n            - Weeks 3-4:\n            - Weeks 5-6:\n            - Weeks 7-8:\n            - Weeks 9-10:\n            - Weeks 11-12:\n            - Weeks 13-14:\n            ",
  "Additional Resources": "\n                     ",
  "Proposed by": "Dr. Andrew Wiss - GWSPH assistant Dean for academic innovation and professorial lecture in the Department of Health Policy and management ",
  "Proposed by email": "awiss@gwu.edu",
  "instructor": "Amir Jafari",
  "instructor_email": "ajafari@gwu.edu",
  "collaborator": "",
  "funding_opportunity": "",
  "github_repo": "https://github.com/amir-jafari"
}